// // Завд1 - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// // (в першу, другу, третю или четверту частину години).
// let time = +prompt('Введіть час (від 0 до 59):');
// if (0 <= time && time < 15) {
//     console.log('Ваш час попадає в першу четверть години')
// } else if (15 <= time && time < 30) {
//     console.log('Ваш час попадає в другу четверть години')
// } else if (30 <= time && time < 45) {
//     console.log('Ваш час попадає в третю четверть години')
// } else if (45 <= time && time < 60) {
//     console.log('Ваш час попадає в четверту четверть години')
// } else {
//     console.log('Некоректно введений час')
// }


// // Завд2  - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('Введіть число (від 1 до 31):');
// if (0 < day && day < 11) {
//     console.log('Введене число потрапляє в I декаду місяця')
// } else if (10 < day && day < 21) {
//     console.log('Введене число потрапляє в II декаду місяця')
// } else if (20 < day && day < 32) {
//     console.log('Введене число потрапляє в III декаду місяця')
// } else {
//     console.log('Не коректно введене число')
// }


// // Завд3 - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// // Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = 5;
// if (test === true){
//     console.log('Вірно')
// } else {
//     console.log('Неправильно')
// }
// let test2 = true;
// (test2 === true) ? console.log('Вірно') : console.log('Неправильно');


// // Завд4 - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// // Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = +prompt('Введіть число:');
// if (a !== 0) {
//     console.log('Вірно')
// } else {
//     console.log('Не вірно')
// }
// let b = +prompt('Введіть число:');
// (b !== 0) ? console.log('Вірно') : console.log('Не вірно')


// // Завд5 - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і
// // на екрані відображається інфа що заплановано на цей день.
// let day = +prompt('Введіть порядковий номер дня тижня');
// switch (day){
//     case 1: console.log('Провести лекцію 1 в OktenWeb')
//         break
//     case 2: console.log('Провести лекцію 2 в OktenWeb')
//         break
//     case 3: console.log('Провести лекцію 3 в OktenWeb')
//         break
//     case 4: console.log('Провести лекцію 4 в OktenWeb')
//         break
//     case 5: console.log('Провести лекцію 5 в OktenWeb')
//         break
//     case 6: console.log('Провести лекцію 6 в OktenWeb')
//         break
//     case 7: console.log('Сьогодні можна відпочити')
//         break
//     default: console.log('Такого дня тижня не існує');
// }


// // Завд6 - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let days = +prompt('Введіть кількість днів у році');
// if (days === 365 || days === 366) {
//     (days % 3 === 0) ? console.log('Рік високосний') : console.log('Рік звичайний')
// } else
//     console.log('Не коректно введено кількість днів у році')


// // Завд7 - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// // Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let question = prompt('Яка «офіційна» назва JavaScript?');
// (question === 'ECMAScript') ? console.log('Правильно!') : console.log('Не знаєте? ECMAScript!')
