// // Завд1 - Користувач вводить або має два числа.
// // Потрібно знайти та вивести максимальне число з тих двох .
// // Також потрібно врахувати коли введені рівні числа.
// let a = +prompt('введіть перше число');
// let b = +prompt('введіть друге число');
// if (a < b) {
//     console.log(`${b} є максимальне число`)
// } else if (a > b) {
//     console.log(`${a} є максимальне число`)
// } else {
//     console.log('числа тотожно рівні між собою')
// }


// // Завд2 - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// // Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let number = +prompt('Введіть номер квартири');
// if (0 < number && number < 21) {
//     console.log('Ваша квартира знаходиться в I підїзді')
// } else if (20 < number && number < 49) {
//     console.log('Ваша квартира знаходиться в II підїзді')
// } else if (48 < number && number < 91) {
//     console.log('Ваша квартира знаходиться в III підїзді')
// } else {
//     console.log('В цьому будинку не існує квартири з вказаним номером')
// }


// // Завд3 - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10
// // // вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('Введіть число');
// (number === 10) ? console.log('ВІРНО') : console.log('НЕВІРНО')


// // Завд4 - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// // якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// // якщо в змінну записали щось інше, спрацьовує else
// // let y = prompt('Введіть значення:');
// // if (y <= 0 || y > 0) {
// //     console.log(1)
// // } else if (y === 'true' || y === 'false') {
// //     console.log(3)
// // } else {
// //     console.log(2)
// // }
// let x = [];
// switch (typeof x) {
//     case "number":
//         console.log(1)
//         break
//     case "string":
//         console.log(2)
//         break
//     case 'boolean':
//         console.log(3)
//         break
//     case 'object':
//         console.log(4)
//         break
//     default:
//         console.log('dont understand')
// }


// // Завд5 - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// // Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// // Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let t = parseInt(prompt('Введіть температуру повітря'))
// if (t >= 10 && t <= 22) {
//     console.log('ми йдемо ВЧИТИСЯ')
// } else {
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// }


// // Завд6  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// // І взалежності від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число
// // не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let n = +prompt('Введіть число (від 1 до 5):');
// switch (n) {
//     case 1:
//         console.log('Ви виграли Авто')
//         break
//     case 2:
//         console.log('Ви виграли Мото')
//         break
//     case 3:
//         console.log('Ви виграли Телефон')
//         break
//     case 4:
//         console.log('Ви виграли Ноутбук')
//         break
//     case 5:
//         console.log('Ви виграли 1000грн')
//         break
//     default:
//         console.log('число не вірне')
// }
