// // Завд1 - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// // Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3, то
// // виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// //  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Geisha", "Lera", "Ira"];
// (friends.length >= 3) ? console.log('це великий масив') : console.log('це маленький масив');


// // Завд2   - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// //  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити,
// //  чи знаходиться перше число між двома іншими.
// let a = 3;
// let b = 1;
// let c = 2;
// if ((a < b && b < c) || (c < b && b < a)) {
//     console.log(`${b} є числом яке знаходиться посередині`)
// } else if (a > b && a < c) {
//     console.log(`${a} є числом яке знаходиться першим і знаходиться посередині`)
// } else if (a > c && a < b) {
//     console.log(`${a} є числом яке знаходиться посередині`)
// } else if ((c < a && c > b) || (c < a && c > b)) {
//     console.log(`${c} є числом яке знаходиться посередині`)
// } else {
//     console.log('Середнього числа не існує')
// }


// // Завд3  - Перепишіть конструкцію if з використанням умовного оператора '?':
// //  let result;
// //  if (a + b < 4) {
// //     result = 'Мало';
// //  } else {
// //     result = 'Багато';
// //  }
// let a = 1
// let b = 2
// let result;
// (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);


// // Завд4 - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// // напишіть це тернарним оператором
// let a = +prompt('Введіть число');
// (a < 0) ? (console.log('число є негативним')) : ((a > 0) ? console.log('число є позитивним') : console.log('число є нулем'))
